const partsInStock = [
{
name: 'Фильтр воздушный',
partnumber: 'LA192',
brand: 'LYNX',
crossPN: ['1770050241', '1780150060', 'LX1613'],
},
{
name: 'Фильтр воздушный',
partnumber: 'LA419',
brand: 'LYNX',
crossPN: ['95528550', '95276259', '95273961', '95021102', 'LX3579'],
},
{
name: 'Фильтр воздушный',
partnumber: 'LA2090',
brand: 'LYNX',
crossPN: ['P501133A0', 'P501133A09A', 'P501133A0Y05', 'P501133A0Z03', 'P53N133A0', 'LX4142']
},
{
name: 'Фильтр воздушный',
partnumber: 'LA1253',
brand: 'LYNX',
crossPN: ['31474521', '32146443', 'LX4912']
},
{
name: 'Фильтр воздушный',
partnumber: 'LA1505',
brand: 'LYNX',
crossPN: ['021129620', '021129620D', '021129629', '027129620', '1444Q2', 'LX220']
},
{
name: 'Фильтр салона',
partnumber: 'LAC1945',
brand: 'LYNX',
crossPN: ['64119237159','LA873S']
},
{
name: 'Фильтр салона',
partnumber: 'LAC1908',
brand: 'LYNX',
crossPN: ['971332K000', 'P87902K000A','LA531']
},
{
name: 'Фильтр салона (угольный)',
partnumber: 'LAC144C',
brand: 'LYNX',
crossPN: ['871394802083', '8713948020', '87139YZZ04', '87139YZZ14', '8850848020', 'LA199']
},
{
name: 'Фильтр салона (угольный)',
partnumber: 'LAC1600C',
brand: 'LYNX',
crossPN: ['30630752', '306307520', '9204626', '92046260', '92046267', 'LAK54', 'LA54']
},
{
name: 'Фильтр салона',
partnumber: 'LAC001',
brand: 'LYNX',
crossPN: ['0879038100A', '9761938000', '9761938100', '9761938100AT', '976193C100', '976193C101', '976193C102', '976193E000', '9999Z07010', 'S9761938100AT', 'LA347']
},
{
name: 'Фильтр салона',
partnumber: 'LAC1221',
brand: 'LYNX',
crossPN: ['1668300018', '1668300218', 'A1668300018', 'A1668300218', 'A4638301102', 'LA877']
},
{
name: 'Фильтр воздушный',
partnumber: 'C26014',
brand: 'MANN',
crossPN: ['281131P000', '281132K000', '281131J000', 'S281131P000E', 'S281131P000', 'LX2739']
},
{
name: 'Фильтр салона',
partnumber: 'CU24182',
brand: 'MANN',
crossPN: ['95525119', '95528121', 'A4158351100', 'A4158351300', '2789100Q0D', '2789100Q0F', '7485154094', '7701209837', '272770938R', '272771758R', '8201676037', '93197779',  'LA468S']
},
{
name: 'Фильтр воздушный',
partnumber: 'C26041',
brand: 'MANN',
crossPN: ['0613872A', 'GX739601AA', 'T4A6123', '113123479', 'LR092246', 'LX43351']
},
{
name: 'Фильтр салона',
partnumber: 'CU2733',
brand: 'MANN',
crossPN: ['02C2Z32298', 'C2Z32298', '6G9N180543BA', '6G9N19N619BA', '6G9N19N619BD', 'LR000899', 'LR000901', 'LR019192', 'LR019589', 'LR039612', 'LR039621', 'LR056138', '30733893', '30767022', '30767024', '31366124', '31390880', '30733894', '31366123', '31449209', 'LA387']
},
{
name: 'Фильтр салона',
partnumber: 'CU22016',
brand: 'MANN',
crossPN: ['A0008351500', 'LA1263']
},
{
name: 'Фильтр воздушный',
partnumber: 'C35177',
brand: 'MANN',
crossPN: ['30748212', '31370161', '31650021', 'LX15912', 'LX15919', 'LX5069']
},
{
name: 'Фильтр салона (антибактериальный)',
partnumber: 'FP31003',
brand: 'MANN',
crossPN: ['8W0819439B', 'L8WD819439', 'PAB81943900', '4M0819439', '4M0819439A', '4M0819439B', '8W0819439', '8W0819439A', 'LA1294', 'LAK1294', 'LAO1294']
},
{
name: 'Фильтр салона (антибактериальный)',
partnumber: 'FP26023',
brand: 'MANN',
crossPN: ['A2058350047', 'A2058350147', 'A2068350100', 'LA1161', 'LAK1161', 'LAO1161']
},
{
name: 'Фильтр воздушный',
partnumber: 'C43121',
brand: 'MANN',
crossPN: ['68013676AA', 'A0000902651', 'A0000903751', '2E0129620B', '2E0129620D', 'LX1845']
},
]